<template>
<v-container fluid class="pa-2">
<h1 class="mb-1">ITEM LIST ～ スキルアップ素材獲得ステージリスト ～</h1>

<v-expansion-panels class="mb-5">
  <v-expansion-panel>
    <v-expansion-panel-title>ページ詳細</v-expansion-panel-title>
    <v-expansion-panel-text>
      Quest Liveで入手できるスキルアップ素材一覧です。<br>
      プルダウンから獲得可能アイテムを選択すると、その素材が入手できるステージを絞り込めます。
    </v-expansion-panel-text>
  </v-expansion-panel>
</v-expansion-panels>

<!--<v-row
  no-gutters
  v-for="arr in [{id:1,label:'技能書'}, {id:2,label:'ピース'}, {id:3,label:'チャーム'}]"
  :key="arr"
>
  <v-col cols="12" class="mb-5">
    <v-select
      v-model="select['item' + arr.id].value"
      :items="select['item' + arr.id].item"
      chips
      :label="`獲得可能アイテム(${arr.label}系)`"
      multiple
      clearable
      color="pink"
      base-color="pink"
      :hint="`絞り込みたい${arr.label}系アイテムを選んでください`"
      persistent-hint
    ></v-select>
  </v-col>
</v-row>-->

<v-row no-gutters>
  <!--<v-col cols="6">
    <v-select
      v-model="select.season.value"
      :items="select.season.item"
      attach
      chips
      label="Select Season"
      multiple
      clearable
    ></v-select>
  </v-col>
  <v-col cols="6">
    <v-select
      v-model="select.area.value"
      :items="select.area.item"
      attach
      chips
      label="Select Area"
      multiple
      clearable
    ></v-select>
  </v-col>-->
  <v-col
    v-for="(v, i) in ['技能書', 'ピース', 'チャーム']"
    :key="i"
    cols="12"
    class="mb-5"
  >
    <v-select
      v-model="store.localStorageData.selectItemList[`item${i + 1}`]"
      :items="filterItemList[`item${i + 1}`]"
      attach
      chips
      :label="`獲得可能アイテム(${v}系)`"
      multiple
      clearable
      color="pink"
      base-color="pink"
      variant="outlined"
      :hint="`絞り込みたい${v}系アイテムを選んでください`"
      persistent-hint
    >
      <template v-slot:chip="{ item }">
        <v-chip
          v-if="item.title !== '-'"
          pill
          class="pl-0"
          :color="searchColor(item.title)"
        >
          <v-avatar left class="mr-1">
            <v-img
              :src="require(`@/assets/trainingItem_icon/${item.title}.webp`)"
            ></v-img>
          </v-avatar>
          {{ item.title }}
        </v-chip>
        <v-chip v-else>{{ item.title }}</v-chip>
      </template>
      <template v-slot:item="{ item }">
        <v-list-item
          :title="item.title"
          @click="selectItem(store, item.title, i + 1)"
        >
          <template v-slot:prepend>
            <v-checkbox-btn
              color="pink"
              :model-value="store.localStorageData.selectItemList[`item${i + 1}`].some((elm) => elm === item.title)"
            ></v-checkbox-btn>
            <v-img
              v-if="item.title !== '-'"
              :src="require(`@/assets/trainingItem_icon/${item.title}.webp`)"
              :alt="item.title"
              style="width: 40px;"
            ></v-img>
          </template>
        </v-list-item>
      </template>
    </v-select>
  </v-col>
</v-row>

<v-row no-gutters>
  <v-col cols="12">
    <v-data-table
      :headers="headers"
      :items="filterItems(store)"
      item-key="name"
      density="comfortable"
      items-per-page="75"
      items-per-page-text="1ページあたりの最大表示数"
      :items-per-page-options="[
        {value: 15, title: '15'},
        {value: 30, title: '30'},
        {value: 45, title: '45'},
        {value: 60, title: '60'},
        {value: 75, title: '75'},
        {value: -1, title: '$vuetify.dataFooter.itemsPerPageAll'}
      ]"
      multi-sort
      no-data-text="見つからなかったよ😢"
    >
      <template v-slot:item="{ item }">
        <tr>
          <td>{{ item.name }}</td>
          <td>{{ item.area }}</td>
          <td>{{ item.stage }}</td>
          <td
            v-for="i in 3"
            :key="i"
          >
            <v-chip
              v-if="item['獲得可能アイテム'][i - 1] !== '-'"
              pill
              class="pl-0"
              :color="searchColor(item['獲得可能アイテム'][i - 1])"
            >
              <v-avatar left class="mr-1">
                <v-img
                  :src="require(`@/assets/trainingItem_icon/${item['獲得可能アイテム'][i - 1]}.webp`)"
                ></v-img>
              </v-avatar>
              {{ item['獲得可能アイテム'][i - 1] }}
            </v-chip>
            <v-chip v-else>{{ item['獲得可能アイテム'][i - 1] }}</v-chip>
          </td>
        </tr>
      </template>
    </v-data-table>
  </v-col>
</v-row>
</v-container>
</template>

<script setup>
import { useStoreCounter } from '../stores/counter';
const store = useStoreCounter();
</script>

<script>
export default {
  name: 'ItemList',
  data() {
    return {
      filterItemList: {
        season: ['103期Spring', '103期Summer', '103期Autumn', '103期Winter', '104期Spring'],
        area: ['Area1', 'Area2', 'Area3', 'Area4', 'Area5'],
        item1: ['-', '技能書(初等)', '技能書(中等)', '技能書(高等)'],
        item2: [
          '-',
          'ガーネットピース(R1)',
          'ガーネットピース(R2)',
          'ガーネットピース(R3)',
          'ガーネットピース(R4)',
          'カーネリアンピース(R1)',
          'カーネリアンピース(R2)',
          'カーネリアンピース(R3)',
          'カーネリアンピース(R4)',
          'エメラルドピース(R1)',
          'エメラルドピース(R2)',
          'エメラルドピース(R3)',
          'エメラルドピース(R4)',
          'ダイヤピース(R1)',
          'ダイヤピース(R2)',
          'ダイヤピース(R3)',
          'ダイヤピース(R4)',
          'ペリドットピース(R1)',
          'ペリドットピース(R2)',
          'ペリドットピース(R3)',
          'ペリドットピース(R4)',
          'ルビーピース(R1)',
          'ルビーピース(R2)',
          'ルビーピース(R3)',
          'ルビーピース(R4)',
          'サファイアピース(R1)',
          'サファイアピース(R2)',
          'サファイアピース(R3)',
          'サファイアピース(R4)',
          'トパーズピース(R1)',
          'トパーズピース(R2)',
          'トパーズピース(R3)',
          'トパーズピース(R4)',
          'ターコイズピース(R1)',
          'ターコイズピース(R2)',
          'ターコイズピース(R3)',
          'ターコイズピース(R4)',
          'アメジストピース(R1)',
          'アメジストピース(R2)',
          'アメジストピース(R3)',
          'アメジストピース(R4)'
        ],
        item3: [
          '-',
          'ソルチャーム(R3)',
          'ソルチャーム(R4)',
          'ルナチャーム(R3)',
          'ルナチャーム(R4)',
          'ステラチャーム(R3)',
          'ステラチャーム(R4)'
        ]
      },
      selectedItem: {
        season: ['103期Spring', '103期Summer', '103期Autumn', '103期Winter', '104期Spring'],
        area: ['103期Spring', '103期Summer', '103期Autumn', '103期Winter', '104期Spring'],
        item1: [],
        item2: [],
        item3: []
      },
      headers: [
        { title: '期/季節', sortable: false, value: 'name' },
        { title: 'エリア', value: 'area' },
        { title: 'ステージ', value: 'stage' },
        { title: '獲得可能アイテム(技能書系)', value: '獲得可能アイテム1' },
        { title: '獲得可能アイテム(ピース系)', value: '獲得可能アイテム2' },
        { title: '獲得可能アイテム(チャーム系)', value: '獲得可能アイテム3' },
        /*{
          title: '獲得可能アイテム',
          children: [
            { title: '技能書系', value: '獲得可能アイテム1' },
            { title: 'ピース系', value: '獲得可能アイテム2' },
            { title: 'チャーム系', value: '獲得可能アイテム3' }
          ]
        },*/
        //{ title: '低確率獲得可能アイテム', value: '低確率獲得可能アイテム' },
      ],
      list: {
        103: {
          Spring: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
          ],
          Summer: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ],
          Autumn: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ],
          Winter: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ターコイズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'アメジストピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ターコイズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'アメジストピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ターコイズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'アメジストピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ターコイズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'アメジストピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'アメジストピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ターコイズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ターコイズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'アメジストピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'アメジストピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ターコイズピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ターコイズピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'アメジストピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ]
        },
        104: {
          Spring: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ダイヤピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'エメラルドピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'エメラルドピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ダイヤピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ルナチャーム(R4)',],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ダイヤピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'エメラルドピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ],
          Summer: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ルビーピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ペリドットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ペリドットピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ルビーピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ソルチャーム(R4)',],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ルビーピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ペリドットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ],
          Autumn: [
            [
              {
                '獲得可能アイテム': ['技能書(初等)', '-', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['-', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R1)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', '-'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'ガーネットピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'トパーズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(初等)', 'サファイアピース(R2)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R2)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R2)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R3)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R3)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R3)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'ガーネットピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ],
            [
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'サファイアピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'カーネリアンピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(中等)', 'トパーズピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R4)', 'ステラチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R3)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'トパーズピース(R4)', 'ソルチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'ガーネットピース(R4)', 'ルナチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R4)', 'ルナチャーム(R3)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'サファイアピース(R3)', 'ソルチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              },
              {
                '獲得可能アイテム': ['技能書(高等)', 'カーネリアンピース(R4)', 'ステラチャーム(R4)'],
                //'低確率獲得可能アイテム': '技能書(初等)',
              }
            ]
          ]
        }
      },
      allItemList: [],
      colorList: {
        '技能書(初等)': 'green',
        '技能書(中等)': 'orange',
        '技能書(高等)': 'red',
        'ガーネットピース': 'pink-darken-1',
        'エメラルドピース': 'green-accent-3',
        'カーネリアンピース': 'deep-orange-accent-3',
        'ダイヤピース': 'grey-darken-1',
        'ペリドットピース': 'light-green-accent-3',
        'ルビーピース': 'pink-accent-3',
        'サファイアピース': 'blue-accent-4',
        'トパーズピース': 'yellow-darken-4',
        'ターコイズピース': 'cyan-lighten-3',
        'アメジストピース': 'deep-purple',
        'ソルチャーム': 'orange-darken-4',
        'ルナチャーム': 'blue-accent-4',
        'ステラチャーム': 'yellow-darken-3'
      }
    }
  },
  created() {
    let i = 1;

    for (const term in this.list) {
      for (const season in this.list[term]) {
        for (const area in this.list[term][season]) {
          i = 1;

          for (const arr of this.list[term][season][area]) {
            arr.name = `${term}期${season}`;
            arr.area = Number(area) + 1;
            arr.stage = i;
            i++;
          }

          this.allItemList = this.allItemList.concat(this.list[term][season][area]);
        }
      }
    }
  },
  computed: {},
  methods: {
    filterItems(store) {
      const _this = this;
      let result = _this.allItemList;

      for (let i = 1; i <= 3; i++) {
        result = ((i) => {
          if (store.localStorageData.selectItemList[`item${i}`].length > 0 && store.localStorageData.selectItemList[`item${i}`].length < _this.filterItemList[`item${i}`].length) {
            const regex = new RegExp(store.localStorageData.selectItemList[`item${i}`].join('|').replace(/\(/g, '\\(').replace(/\)/g, '\\)'))
            return result.filter(arr => regex.test(arr['獲得可能アイテム'][i - 1]));
          } else {
            return result;
          }
        })(i);
      }

      store.setLocalStorage('llllMgr_selectItemList', {
        item1: store.localStorageData.selectItemList.item1,
        item2: store.localStorageData.selectItemList.item2,
        item3: store.localStorageData.selectItemList.item3
      });

      return result;
    },
    searchColor(target) {
      let color;

      for (const itemName in this.colorList) {
        if (target.includes(itemName)) {
          color = this.colorList[itemName];
          break;
        }
      }

      return color;
    },
    selectItem(store, selector, i) {
      if (store.localStorageData.selectItemList[`item${i}`].some((x) => x === selector)) {
        store.localStorageData.selectItemList[`item${i}`] = store.localStorageData.selectItemList[`item${i}`].filter((item) => item !== selector);
      } else {
        store.localStorageData.selectItemList[`item${i}`].push(selector);
      }
    }
  }
};
</script>