<template>
  <v-container fluid>
    <h1 class="mb10">ITEM LIST ～スキルアップ素材獲得ステージリスト～</h1>
    <v-row>
      <v-col cols="12">
        <v-expansion-panels>
          <v-expansion-panel>
            <v-expansion-panel-title>ページ詳細</v-expansion-panel-title>
            <v-expansion-panel-text>
              Quest Liveで入手できるスキルアップ素材一覧です。<br>
              プルダウンから獲得可能アイテムを選択すると、その素材が入手できるステージを絞り込めます。
            </v-expansion-panel-text>
          </v-expansion-panel>
        </v-expansion-panels>
      </v-col>
    </v-row>
    <v-row>
      <!--<v-col cols="6">
        <v-select
          v-model="select.season.value"
          :change="changeItem()"
          :items="select.season.item"
          attach
          chips
          label="Select Season"
          multiple
          clearable
        ></v-select>
      </v-col>
      <v-col cols="6">
        <v-select
          v-model="select.area.value"
          :items="select.area.item"
          attach
          chips
          label="Select Area"
          multiple
          clearable
        ></v-select>
      </v-col>-->
      <v-col cols="12">
        <v-select
          v-model="select.item1.value"
          :items="select.item1.item"
          :change="changeItem()"
          attach
          chips
          label="獲得可能アイテム1"
          multiple
          clearable
          dense
        ></v-select>
      </v-col>
      <v-col cols="12">
        <v-select
          v-model="select.item2.value"
          :items="select.item2.item"
          :change="changeItem()"
          attach
          chips
          label="獲得可能アイテム2"
          multiple
          clearable
          dense
        ></v-select>
      </v-col>
      <v-col cols="12">
        <v-select
          v-model="select.item3.value"
          :items="select.item3.item"
          :change="changeItem()"
          attach
          chips
          label="獲得可能アイテム3"
          multiple
          clearable
          dense
        ></v-select>
      </v-col>
    </v-row>
    <!--<v-data-table
      :headers="headers"
      :items="filterItem"
      :items-per-page="15"
      class="elevation-1"
    ></v-data-table>-->
    <v-table>
      <thead>
        <tr>
          <th
            v-for="item in this.headers"
            :key="item.value"
          >
            {{ item.text }}
          </th>
        </tr>
      </thead>
      <tbody>
        <tr
          v-for="items in this.filterItem"
          :key="items"
        >
          <td
            v-for="item in items"
            :key="item"
          >
            {{ item }}
          </td>
        </tr>
      </tbody>
    </v-table>
  </v-container>
</template>

<script>
export default {
  name: 'ItemList',
  data() {
    return {
      select: {
        season: {
          item: ['103期Spring', '103期Summer', '103期Autumn', '103期Winter'],
          value: ['103期Spring', '103期Summer', '103期Autumn', '103期Winter']
        },
        area: {
          item: ['Area1', 'Area2', 'Area3', 'Area4', 'Area5'],
          value: ['Area1', 'Area2', 'Area3', 'Area4', 'Area5']
        },
        item1: {
          item: ['技能書(初等)', '技能書(中等)', '技能書(高等)'],
          value: []
        },
        item2: {
          item: [
            'ガーネットピース(R1)',
            'ガーネットピース(R2)',
            'ガーネットピース(R3)',
            'ガーネットピース(R4)',
            'エメラルドピース(R1)',
            'エメラルドピース(R2)',
            'エメラルドピース(R3)',
            'エメラルドピース(R4)',
            'カーネリアンピース(R1)',
            'カーネリアンピース(R2)',
            'カーネリアンピース(R3)',
            'カーネリアンピース(R4)',
            'ダイヤピース(R1)',
            'ダイヤピース(R2)',
            'ダイヤピース(R3)',
            'ダイヤピース(R4)',
            'ペリドットピース(R1)',
            'ペリドットピース(R2)',
            'ペリドットピース(R3)',
            'ペリドットピース(R4)',
            'ルビーピース(R1)',
            'ルビーピース(R2)',
            'ルビーピース(R3)',
            'ルビーピース(R4)',
            'サファイアピース(R1)',
            'サファイアピース(R2)',
            'サファイアピース(R3)',
            'サファイアピース(R4)',
            'トパーズピース(R1)',
            'トパーズピース(R2)',
            'トパーズピース(R3)',
            'トパーズピース(R4)'
          ],
          value: []
        },
        item3: {
          item: ['-', 'エメラルドピース(R3)', 'ペリドットピース(R3)', 'ソルチャーム(R3)', 'ルナチャーム(R3)', 'ステラチャーム(R3)', 'ソルチャーム(R4)', 'ルナチャーム(R4)', 'ステラチャーム(R4)'],
          value: []
        }
      },
      selectSeasonItem: ['103期Spring', '103期Summer', '103期Autumn'],
      selectSeasonValue: ['103期Spring', '103期Summer', '103期Autumn'],
      selectAreaItem: ['Area1', 'Area2', 'Area3', 'Area4', 'Area5'],
      selectAreaValue: ['Area1', 'Area2', 'Area3', 'Area4', 'Area5'],
      selectItem1: ['技能書(初等)'],
      selectItemValue1: ['技能書(初等)'],
      selectItem2: ['ガーネットピース(R1)', 'ガーネットピース(R2)'],
      selectItemValue2: ['ガーネットピース(R1)'],
      selectItem3: ['ステラチャーム(R3)'],
      selectItemValue3: ['ステラチャーム(R3)'],
      filterItem: [],
      headers: [
        {
          text: '期/季節',
          sortable: false,
          value: 'name',
        },
        { text: 'エリア', value: 'area' },
        { text: 'ステージ', value: 'stage' },
        { text: '獲得可能アイテム1', value: '獲得可能アイテム1' },
        { text: '獲得可能アイテム2', value: '獲得可能アイテム2' },
        { text: '獲得可能アイテム3', value: '獲得可能アイテム3' },
        //{ text: '低確率獲得可能アイテム', value: '低確率獲得可能アイテム' },
      ],
      list: {
        '103期Spring': {
          Area1: [
            {
              name: '103期Spring',
              area: 1,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 2,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 3,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 5,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 6,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 8,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 9,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 11,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 12,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 14,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 1,
              stage: 15,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area2: [
            {
              name: '103期Spring',
              area: 2,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 3,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 4,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 5,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 6,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 9,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 10,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 11,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 2,
              stage: 15,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area3: [
            {
              name: '103期Spring',
              area: 3,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'エメラルドピース(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ダイヤピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 3,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area4: [
            {
              name: '103期Spring',
              area: 4,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ダイヤピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R1)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 7,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 8,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 9,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 10,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 13,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 14,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 4,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area5: [
            {
              name: '103期Spring',
              area: 5,
              stage: 1,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 4,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 5,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 6,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 7,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 10,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 11,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ダイヤピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 13,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'エメラルドピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'エメラルドピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Spring',
              area: 5,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ダイヤピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
        },
        '103期Summer': {
          Area1: [
            {
              name: '103期Summer',
              area: 1,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 2,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 3,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 5,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 6,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 8,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 9,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 11,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 12,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 14,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 1,
              stage: 15,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area2: [
            {
              name: '103期Summer',
              area: 2,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 3,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 4,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 5,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 6,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 9,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 10,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 11,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 2,
              stage: 15,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area3: [
            {
              name: '103期Summer',
              area: 3,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ペリドットピース(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ルビーピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 3,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area4: [
            {
              name: '103期Summer',
              area: 4,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ルビーピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R1)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 7,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 8,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 9,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 10,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 13,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 14,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 4,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area5: [
            {
              name: '103期Summer',
              area: 5,
              stage: 1,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 4,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 5,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 6,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 7,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 10,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 11,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ルビーピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 13,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ペリドットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ペリドットピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Summer',
              area: 5,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ルビーピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ]
        },
        '103期Autumn': {
          Area1: [
            {
              name: '103期Autumn',
              area: 1,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 2,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 3,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 5,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 6,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 8,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 9,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 11,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 12,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 14,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 1,
              stage: 15,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area2: [
            {
              name: '103期Autumn',
              area: 2,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 3,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 6,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 7,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 8,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 9,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R1)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 13,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 2,
              stage: 15,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': '-',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area3: [
            {
              name: '103期Autumn',
              area: 3,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'サファイアピース(R1)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 7,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 10,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'サファイアピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'トパーズピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 13,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'ガーネットピース(R1)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 14,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 3,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area4: [
            {
              name: '103期Autumn',
              area: 4,
              stage: 1,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'トパーズピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'サファイアピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 4,
              '獲得可能アイテム1': '技能書(初等)',
              '獲得可能アイテム2': 'カーネリアンピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 5,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R2)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 6,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R2)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 7,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 8,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 9,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R2)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 10,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 11,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 12,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 13,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 14,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 4,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'カーネリアンピース(R3)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ],
          Area5: [
            {
              name: '103期Autumn',
              area: 5,
              stage: 1,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'サファイアピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 2,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 3,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 4,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 5,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'サファイアピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 6,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R3)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 7,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 8,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 9,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'サファイアピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 10,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'トパーズピース(R3)',
              '獲得可能アイテム3': 'ソルチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 11,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ステラチャーム(R4)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 12,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'カーネリアンピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 13,
              '獲得可能アイテム1': '技能書(中等)',
              '獲得可能アイテム2': 'サファイアピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 14,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'トパーズピース(R4)',
              '獲得可能アイテム3': 'ルナチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            },
            {
              name: '103期Autumn',
              area: 5,
              stage: 15,
              '獲得可能アイテム1': '技能書(高等)',
              '獲得可能アイテム2': 'ガーネットピース(R4)',
              '獲得可能アイテム3': 'ソルチャーム(R3)',
              //'低確率獲得可能アイテム': '技能書(初等)',
            }
          ]
        },
        '103期Winter': {
          Area1: [],
          Area2: [],
          Area3: [],
          Area4: [],
          Area5: []
        }
      }
    }
  },
  computed: {
    tst() {
      return false;
    },
    /* filterItems() {
      let obj = {};
      
      for (let i = 0; i < this.value.length; i++) {
        obj = Object.assign(obj, this.value[i]);
      }

      return [obj];
    } */
  },
  created() {
    if (localStorage.llllMgr_selectItemList !== undefined) {
      const getSelectItemList = JSON.parse(localStorage.llllMgr_selectItemList);

      for (let i = 1; i <= 3; i++) {
        this.select['item' + i].value = getSelectItemList['item' + i];
      }
    }
  },
  methods: {
    changeItem() {
      let obj = [];
      let obj2 = [];
      let obj3 = [];
      let obj4 = [];

      for (const season in this.list) {
        for (const area in this.list[season]) {
          obj = obj.concat(this.list[season][area]);
        }
      }

      /*for (let i = 0; i < obj.length; i++) {
        if (this.select.item1.value.length > 0 && this.select.item1.value.length < this.select.item1.item.length) {
          for (const selectItem1 of this.select.item1.value) {
            for (let i = 0; i < obj.length; i++) {
              if (obj[i]['獲得可能アイテム1'] === selectItem1) {
                obj2.push(obj[i]);
              }
            }
          }
        }
        
      }*/

      if (this.select.item1.value.length === 0 || this.select.item1.value.length === this.select.item1.item.length) {
        obj2 = obj;
      } else {
        for (const selectItem1 of this.select.item1.value) {
          for (let i = 0; i < obj.length; i++) {
            if (obj[i]['獲得可能アイテム1'] === selectItem1) {
              obj2.push(obj[i]);
            }
          }
        }
      }

      if (this.select.item2.value.length === 0 || this.select.item2.value.length === this.select.item2.item.length) {
        obj3 = obj2;
      } else {
        for (const selectItem2 of this.select.item2.value) {
          for (let i = 0; i < obj2.length; i++) {
            if (obj2[i]['獲得可能アイテム2'] === selectItem2) {
              obj3.push(obj2[i]);
            }
          }
        }
      }

      if (this.select.item3.value.length === 0 || this.select.item3.value.length === this.select.item3.item.length) {
        obj4 = obj3;
      } else {
        for (const selectItem3 of this.select.item3.value) {
          for (let i = 0; i < obj3.length; i++) {
            if (obj3[i]['獲得可能アイテム3'] === selectItem3) {
              obj4.push(obj3[i]);
            }
          }
        }
      }

      /*obj4.sort((a, b) => {
        return a.area < b.area ? -1: 1;
      });
      
      for (let i = 0; i < this.select.season.value.length; i++) {
        //obj = Object.assign(obj, this.list[this.value[i]]);
        obj = obj.concat(this.list[this.select.season.value[i]]);
      }
      
      for (let i = 0; i < this.select.item1.value.length; i++) {
        obj = obj.concat(this.list[this.select.item1.value[i]]);
      }*/

      this.filterItem = obj4;
      this.setLocalStrage();
    },
    setLocalStrage() {
      const setLocalStrageDataList = {
        item1: this.select.item1.value,
        item2: this.select.item2.value,
        item3: this.select.item3.value
      };
      
      localStorage.llllMgr_selectItemList = JSON.stringify(setLocalStrageDataList);
    }
  }
};
</script>
