<template>
  <v-container fluid>
    <v-row>
      <v-col>
        <h1 class="mb-2">LICENSE</h1>
        本サイトは、著作権法第32条に基づき画像を引用しております。<br>
        著作権・知的財産権は、すべて権利元に帰属いたします。<br>
        権利者様側からの画像等の削除依頼や警告については、速やかに対処いたします。
      </v-col>
    </v-row>
    <v-row>
      <v-col>
        <h1 class="mb-2">免責事項</h1>
        本サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めております。<br>
        しかし、個人が作成・管理する性質上、誤情報が入り込んだり、情報が古くなっていたり、不足している場合もございます。<br>
        その際は、お手数ですが該当箇所を本サイト作者にお知らせくださいますと幸いです。<br>
        (特にレベル11～13のスペシャルアピール/スキルのデータが不足しがちなので、ご提供くださいますと大変助かります)<br>
        <br>
        本サイトは、個人が作成・管理するファンサイトになります。<br>
        本サイトに関わる内容について、運営会社・権利元・キャスト・その他プロジェクトラブライブ！蓮ノ空女学院スクールアイドルクラブに関わる企業・人物へ問い合わせることはお止めください。<br>
        <br>
        本サイトに掲載された内容によって生じた損害等について、一切の責任を負いかねます。<br>
        ご了承の上、ご利用くださいますようお願いいたします。
      </v-col>
    </v-row>
    <v-row>
      <v-col>
        <h1 class="mb-2">LINK</h1>
        本サイトは、原則リンクフリーです。<br>
        リンクを行う場合の許可や連絡は不要ですので、ガンガン拡散してください！<br>
        (必須ではありませんが、拡散したよ！って連絡してくれると嬉しいです)<br>
        ただし、HOME以外のURLから本サイトへ訪問する際、必ずHOMEへ遷移する仕様がございます。<br>
        例えば、SNSにLICENSEページのURL(https://github.com/taira-no-atsumori/llllMgr/license)が貼り付けられていた場合、クリックするとHOMEページ(https://github.com/taira-no-atsumori/llllMgr/)が表示されます。<br>
        これは、本サイトで使用しているVue Routerの影響によるものです。<br>
        ご理解の上、ご利用くださいますようお願いいたします。<br>
      </v-col>
    </v-row>
  </v-container>
</template>