<template>
  <h2 class="text-center mb-2">解放Pt.とは？</h2>

  <p>
    ガチャで入手したカードが重複していた場合に獲得できるのが「解放Pt.」です。<br />
    この解放Pt.を設定していると、カード一覧のカード画像の右上に<span
      class="text-blue-accent-4"
      >●</span
    >がつきます。<br />
    なお、解放Lv.を上げると、現在設定されている解放Pt.から解放Lv.を上げるのに必要な解放Pt.を自動的に消費し、設定できる解放Pt.の上限も変化します。<br />
    ※解放Lv.を下げた場合は設定できる解放Pt.の上限は上がりますが、解放Pt.は変化しません。<br /><br />
  </p>
  <p>
    例1）解放Pt.を250に設定してURカードの解放Lv.を1から2に上げた場合<br />
    設定できる解放Pt.の上限：400→300<br />
    解放Pt.：250→150<br /><br />
  </p>
  <p>
    例2）解放Pt.を150に設定してURカードの解放Lv.を2から5(MAX)に上げた場合<br />
    設定できる解放Pt.の上限：300→0<br />
    解放Pt.：150→0<br /><br />
  </p>
  <p>
    例3）解放Pt.を98に設定してURカードの解放Lv.を4から1(MIN)に下げた場合<br />
    設定できる解放Pt.の上限：100→400<br />
    解放Pt.：98→98
  </p>
</template>
